# <center> ESTATÍSTICA APLICADA </center>

# <center>  Lista de exercícios 4 </center>

# <center>  José Silvestre da Silva Galvão </center>

### <center> Questão 1 </center>

In [18]:
import pandas as pd
import numpy as np

In [19]:
Mercearia = pd.DataFrame({"loja":["A", "A", "A"],
"dia": ["sex", "sab", "dom"],
"valor": [7500, 9500, 8200]})

In [20]:
Mercearia

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200

In [21]:
Farmácia = pd.DataFrame({"loja":["B", "B", "B"],
"dia": ["sex", "sab", "dom"],
"valor": [5100, 8250, 9900]})

In [22]:
Farmácia

  loja  dia  valor
0    B  sex   5100
1    B  sab   8250
2    B  dom   9900

In [23]:
Restaurante = pd.DataFrame({"loja":["C", "C"],
"dia": ["sab", "dom"],
"valor": [7500, 11800]})

#### Sentido da linha

In [24]:
tlojasl = pd.concat([Mercearia, Farmácia, Restaurante], ignore_index=True)

In [25]:
tlojasl

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
3    B  sex   5100
4    B  sab   8250
5    B  dom   9900
6    C  sab   7500
7    C  dom  11800

#### Sentido da coluna

In [32]:
tlojasc = pd.concat([Mercearia, Farmácia, Restaurante], axis=1)

In [33]:
tlojasc

  loja  dia  valor loja  dia  valor loja  dia    valor
0    A  sex   7500    B  sex   5100    C  sab   7500.0
1    A  sab   9500    B  sab   8250    C  dom  11800.0
2    A  dom   8200    B  dom   9900  NaN  NaN      NaN

Ao usar o axis=1 no segundo codígo faz com que o data frame fique "maior" com mais colunas e menos linha, ao contrário da primeira que não utilizei o axis e ficou mais linhas e menos colunas. Na saída do dataframe no dentido da coluna, como a loja C tinha apenas doius dias de valores o indice 2 ficou sem sem valor, justamente porque no dataset não tinha valores depois do indice 1.

### <center> Questão 2 </center>

**QUESTÃO 2- A)**

In [56]:
SQL = pd.DataFrame({"email":["rakesh@xyz.com",
"ecg@acmecorpus.com"]})

In [57]:
SQL

                email
0      rakesh@xyz.com
1  ecg@acmecorpus.com

In [58]:
PYTHON = pd.DataFrame({"email":["ana@xyz.com",
"jonas@acmecorpus.com",
"rakesh@xyz.com"]})

In [59]:
PYTHON

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com
2        rakesh@xyz.com

In [60]:
mail = pd.concat([SQL, PYTHON],ignore_index=True)

In [61]:
mail

                  email
0        rakesh@xyz.com
1    ecg@acmecorpus.com
2           ana@xyz.com
3  jonas@acmecorpus.com
4        rakesh@xyz.com

In [62]:
mail = mail.drop_duplicates()

In [63]:
mail

                  email
0        rakesh@xyz.com
1    ecg@acmecorpus.com
2           ana@xyz.com
3  jonas@acmecorpus.com

**QUESTÃO 2- B)**

In [64]:
both = SQL.merge(PYTHON)

In [65]:
both

            email
0  rakesh@xyz.com

**QUESTÃO 2- C)**

##### Alunos que fizeram PYTHON

In [75]:
soPYTHON = PYTHON[PYTHON.email.isin(SQL.email)==False]

In [76]:
soPYTHON

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com

##### Alunos que fizeram SQL

In [78]:
soSQL = SQL[SQL.email.isin(PYTHON.email)==False]

In [79]:
soSQL

                email
1  ecg@acmecorpus.com

### <center> Questão 3 </center>

In [80]:
dic_emp = {"id":["D1","D2","D3","D4"],
"nomDepto": ["Compras","RH","TI","Vendas"],
"local":["SP","RJ","RJ","SP"]
}
dic_func = {"num":[3199,3269,3555,3788,3844],
"nome": ["Ana","David","José","Marina","Luís"],
"salario":[1600,2975,1500,5000,3000],
"idDepto": ["D2","D3",None,"D2","D4"]
}
empresa = pd.DataFrame(dic_emp)
funcionarios = pd.DataFrame(dic_func)

In [87]:
empresa

   id nomDepto local
0  D1  Compras    SP
1  D2       RH    RJ
2  D3       TI    RJ
3  D4   Vendas    SP

In [88]:
funcionarios

    num    nome  salario idDepto
0  3199     Ana     1600      D2
1  3269   David     2975      D3
2  3555    José     1500    None
3  3788  Marina     5000      D2
4  3844    Luís     3000      D4

In [90]:
juncao = pd.merge(empresa, funcionarios, how="left", left_on='id', right_on= 'idDepto')

In [91]:
juncao

   id nomDepto local     num    nome  salario idDepto
0  D1  Compras    SP     NaN     NaN      NaN     NaN
1  D2       RH    RJ  3199.0     Ana   1600.0      D2
2  D2       RH    RJ  3788.0  Marina   5000.0      D2
3  D3       TI    RJ  3269.0   David   2975.0      D3
4  D4   Vendas    SP  3844.0    Luís   3000.0      D4